import re

password = "rtG3FG!Tr^e"
pattern = r"^(?=.*[A-Z].*[A-Z])(?=.*\d)(?=.*[@$%&*!?^])(?!.*([A-Za-z\d@$%&*!?^])\1\1)[A-Za-z\d@$%&*!?^]{6,}$"
if re.match(pattern, password):
    print("Пароль корректный.")
else:
    print("Пароль некорректный.")

#^-начало строки
#$-конец строки
#^(?=.*[A-Z].*[A-Z])-должно быть минимум две заглавные буквы
#(?=.*\d)- должна быть минимум одна цифра
#(?=.*[@$%&*!?^])- должен быть минимум один из символов
#(?!.*([A-Za-z\d@$%&*!?^])\1\1)- не должно быть трёх одинаковых символов
#[A-Za-z\d@$%&*!?^]{6,}-пароль должен состоять из 6+ символов, где символы могут быть буквами
# в разных регистрах и спец символами и цифрами
#
#